---
kind: method
id: M:Autodesk.Revit.DB.ExtensibleStorage.FieldBuilder.NeedsUnits
source: html/97243405-0f5b-1465-5e4c-847153e455df.htm
---
# Autodesk.Revit.DB.ExtensibleStorage.FieldBuilder.NeedsUnits Method

Checks whether the field type requires explicit unit conversions.

## Syntax (C#)
```csharp
public bool NeedsUnits()
```

## Returns
True if units are required.